<?php
    $regions = [
        "Московская область" => array(
            "Москва",
            "Зеленоград",
            "Клин",
            "Истра",
            "Балашиха",
            "Жуковский",
            "Лобня",
            "Подольск",
            "Реутов",
            "Серпухов"
        ),
        "Ленинградская область" => array(
            "Санкт-Петербург",
            "Всеволжск",
            "Павловск",
            "Кронштадт",
            "Волхов",
            "Выборг",
            "Гатчина",
            "Тосно",
            "Шлиссельбург"
        ),
        "Рязанская область" => array(
            "Рязань",
            "Касимов",
            "Шацк",
            "Ряжск",
            "Михайлов"
        ),
        "Республика Удмуртия" => array(
            "Ижевск",
            "Воткинск",
            "Глазов",
            "Камбарка",
            "Можга",
            "Сарапул"
        ),
        "Краснодарский край" => array(
            "Краснодар",
            "Анапа",
            "Сочи",
            "Геленджик",
            "Ейск",
            "Крымск",
            "Туапсе",
            "Новороссийск"
        ),
    ];
    foreach ($regions as $region => $cities) {
        echo "$region:\n";
        $filteredCities = array_values(
            array_filter(
                $cities,
                function($city){
                    return mb_substr($city, 0, 1) === 'К';
                }
            )
        );
        for ($idx = 0; $idx < count($filteredCities); $idx++) {
            echo "$filteredCities[$idx]";
            if ($idx !== count($filteredCities) - 1) {
                echo ", ";
            }
            else {
                echo "\n";
            }
        }
    }
?>